# BuiltInFailures.RevisionCloudFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionCloudFailures Class
BuiltInFailures Class Members See Also
---
Failures about RevisionCloud.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RevisionCloudFailures
```

Visual Basic
---
```text
Public NotInheritable Class RevisionCloudFailures
```

Visual C++
---
```text
public ref class RevisionCloudFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RevisionCloudFailures
# See Also
BuiltInFailures..::..RevisionCloudFailures Members
Autodesk.Revit.DB Namespace